[
  "\n        Senior Python Developer\n        We are looking for an experienced Python developer with expertise in machine learning \n        and data science. Must have knowledge of TensorFlow, PyTorch, scikit-learn, and pandas. \n        Experience with cloud platforms (AWS, GCP) is a plus.\n        Requirements: 5+ years Python, ML algorithms, REST APIs, SQL databases.\n        ",
  "\n        Java Backend Engineer\n        Join our team as a Java backend engineer to build scalable microservices. \n        Required skills: Spring Boot, REST APIs, MySQL, Redis, Kafka. \n        Experience with Docker and Kubernetes preferred.\n        Location: Remote-friendly. Salary: $120k-$160k.\n        ",
  "\n        Frontend React Developer\n        We need a skilled frontend developer proficient in React, TypeScript, and modern CSS.\n        Experience with Redux, Next.js, and testing frameworks is required.\n        Must have: 3+ years React, responsive design, Git, Agile methodologies.\n        ",
  "\n        Data Scientist\n        Seeking a data scientist to analyze large datasets and build predictive models.\n        Required: Python, pandas, NumPy, scikit-learn, SQL, statistical analysis.\n        Preferred: TensorFlow, deep learning, data visualization (Matplotlib, Plotly).\n        ",
  "\n        DevOps Engineer\n        Looking for a DevOps engineer to manage our cloud infrastructure and CI/CD pipelines.\n        Skills needed: AWS/Azure, Kubernetes, Docker, Terraform, Jenkins, monitoring tools.\n        Experience with Python scripting and Linux administration required.\n        ",
  "\n        Full Stack Developer\n        Full stack position requiring both frontend and backend development skills.\n        Frontend: React, Vue.js, HTML/CSS, JavaScript/TypeScript.\n        Backend: Node.js, Express, Python Django/Flask, PostgreSQL.\n        ",
  "\n        AI/ML Engineer\n        AI engineer role focusing on deep learning and computer vision applications.\n        Must have: TensorFlow, PyTorch, OpenCV, Python, neural networks.\n        Experience with GPU computing (CUDA) and model deployment preferred.\n        ",
  "\n        Cloud Architect\n        Senior cloud architect position for designing scalable cloud solutions.\n        Required: AWS/Azure/GCP certification, microservices, serverless computing.\n        Leadership experience and enterprise architecture knowledge essential.\n        ",
  "\n        Mobile Developer\n        React Native developer for cross-platform mobile applications.\n        Skills: React Native, JavaScript/TypeScript, native iOS/Android development.\n        Experience with app store deployment and mobile UI/UX design.\n        ",
  "\n        Cybersecurity Analyst\n        Information security analyst to protect our systems and data.\n        Required: network security, penetration testing, vulnerability assessment.\n        Certifications preferred: CISSP, CEH, Security+. Python scripting skills.\n        "
]